# Taller de Pandas
Complete los  siguientes ejercicios por pasos que se plantean en este cuaderno usando la libreria Pandas

## Importando pandas

 

**1.** importe pandas usando el alias `pd`.

In [1]:
import pandas as pd

**2.** imprima la version de pandas que ha sido importada.

In [2]:
print(pd.__version__)

0.25.1

## usando DataFrames

### Algunas rutinas para seleccionar, ordenar sumar y añadir datos a  un Dataframe

Nota: recuerde importar numpy usando:
```python
import numpy as np
```

considere el siguente diccionario llamado `data` y la lista llamada `labels`:

``` python
data = {'animal': ['gato', 'gato', 'serpiente', 'perro', 'perro', 'gato', 'serpiente', 'gato', 'perro', 'perro'],
        'edad': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visitas': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'prioridad': ['si', 'si', 'no', 'si', 'no', 'no', 'no', 'si', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```
(relacion de animales y visitas al veterinario)

**4.** cree un dataframe `df` a partir del diccionario `data` con los indices de la lista `labels`.

In [21]:
import numpy as np

data = {'animal': ['gato', 'gato', 'serpiente', 'perro', 'perro', 'gato', 'serpiente', 'gato', 'perro', 'perro'],
        'edad': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visitas': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'prioridad': ['si', 'si', 'no', 'si', 'no', 'no', 'no', 'si', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
#print(data)

#CReando el dataframe
#df = # (complete esta linea)
df = pd.DataFrame(data, labels)
print(df)

      animal  edad  visitas prioridad
a       gato   2.5        1        si
b       gato   3.0        3        si
c  serpiente   0.5        2        no
d      perro   NaN        3        si
e      perro   5.0        2        no
f       gato   2.0        3        no
g  serpiente   4.5        1        no
h       gato   NaN        1        si
i      perro   7.0        2        no
j      perro   3.0        1        no

**5.** Muestre un resumen de la información básica sobre este DataFrame y sus datos (*pista: hay un método único al que se puede llamar en el DataFrame*).

In [4]:
df.info() #Se utiliza para obtener un resumen conciso del marco de datos
df.describe() #Genera estadísticas descriptivas

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
animal       10 non-null object
edad         8 non-null float64
visitas      10 non-null int64
prioridad    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

           edad    visitas
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

**6.** visualice las primeras 3 filas del DataFrame `df`.

In [5]:
df.head(3) #Devuelve las primeras n filas.

      animal  edad  visitas prioridad
a       gato   2.5        1        si
b       gato   3.0        3        si
c  serpiente   0.5        2        no

**7.** Seleccione solo las columnas 'animal' y 'edad' del DataFrame `df`.

In [6]:
op1 = df.drop(['visitas','prioridad'], axis = 'columns', inplace=False) #Elimina las etiquetas especificadas de filas o columnas
print('Con drop:\n',op1)
op2 = df.iloc[:, [0,1]] #Se utiliza en los DataFrames para seleccionar los elementos en base a su ubicación
print('\nCon iloc:\n',op2)

Con drop:
       animal  edad
a       gato   2.5
b       gato   3.0
c  serpiente   0.5
d      perro   NaN
e      perro   5.0
f       gato   2.0
g  serpiente   4.5
h       gato   NaN
i      perro   7.0
j      perro   3.0

Con iloc:
       animal  edad
a       gato   2.5
b       gato   3.0
c  serpiente   0.5
d      perro   NaN
e      perro   5.0
f       gato   2.0
g  serpiente   4.5
h       gato   NaN
i      perro   7.0
j      perro   3.0

**8.** Seleccione los datos en las filas [3, 4, 8]   en las columnas ['animal', 'edad'].

In [7]:
df.iloc[[3, 4, 8], [0, 1]] #seleccionar los elementos iloc[<filas>, <columnas>]

  animal  edad
d  perro   NaN
e  perro   5.0
i  perro   7.0

**9.** Seleccione solo las filas en las que el número de visitas sea superior a 3.

In [8]:
# Solo superior a 3 no hay ningun elemento 
df[df['visitas'] > 3] #Vacio

# Superior o igual a 3 si hay elemento 
op1 = df[df['visitas'] >= 3] 
print('Con seleccionar el indice y condicionar:\n',op1)

#loc se puede usar para seleccionar filas o columnas en base a una condición.
oploc = df.loc[:,'visitas'] >= 3
oploc = df.loc[oploc]
print('\nCon loc:\n',oploc)

Con seleccionar el indice y condicionar:
   animal  edad  visitas prioridad
b   gato   3.0        3        si
d  perro   NaN        3        si
f   gato   2.0        3        no

Con loc:
   animal  edad  visitas prioridad
b   gato   3.0        3        si
d  perro   NaN        3        si
f   gato   2.0        3        no

**10.** Seleccione las filas donde falta la edad, es decir, es `NaN`.

In [9]:
edad_NaN = df[pd.isnull(df['edad'])]['edad'] #Detecta valores nulos
print(edad_NaN)

d   NaN
h   NaN
Name: edad, dtype: float64

**11.** Seleccione las filas donde el animal es un gato *y* la edad es menor de 3.

In [10]:
df[(df.animal == 'gato') & (df.edad < 3)]

  animal  edad  visitas prioridad
a   gato   2.5        1        si
f   gato   2.0        3        no

**12.** Seleccione las filas cuya edad está entre 2 y 4 (inclusive).

In [11]:
op1 = df[(df.edad >= 2) & (df.edad <= 4)] #Condicionar 
print('Con seleccionar el indice y condicionar:\n',op1)

op2 = df[df['edad'].between(2,4)] #Utilizar la funcion between para buscar el rango de valores
print('\nCon between:\n',op2)

Con seleccionar el indice y condicionar:
   animal  edad  visitas prioridad
a   gato   2.5        1        si
b   gato   3.0        3        si
f   gato   2.0        3        no
j  perro   3.0        1        no

Con between:
   animal  edad  visitas prioridad
a   gato   2.5        1        si
b   gato   3.0        3        si
f   gato   2.0        3        no
j  perro   3.0        1        no

**13.** Cambie la edad en la fila `f` a 1.5.

In [12]:
df.loc['f','edad']= 1.5
df

      animal  edad  visitas prioridad
a       gato   2.5        1        si
b       gato   3.0        3        si
c  serpiente   0.5        2        no
d      perro   NaN        3        si
e      perro   5.0        2        no
f       gato   1.5        3        no
g  serpiente   4.5        1        no
h       gato   NaN        1        si
i      perro   7.0        2        no
j      perro   3.0        1        no

**14.** Calcule la suma de todas las visitas en df (es decir, encuentre el número total de visitas).

In [13]:
sumaVis=df['visitas'].sum() #funcion sum 
print(sumaVis)

19

**15.** Calcule la edad media de cada animal diferente en `df`.

In [14]:
df.groupby('animal')['edad'].mean()

animal
gato         2.333333
perro        5.000000
serpiente    2.500000
Name: edad, dtype: float64

**16.** Agrega una nueva fila 'k' a `df` con tu elección de valores para cada columna. Luego elimine esa fila para asi volver al DataFrame original

In [15]:
df.loc['k']=['','','',''] #Con loc tomará la nueva lista como una nueva fila y la añadirá Dataframe
print(df)
df.drop(['k'],axis=0,inplace=True) #drop se eliminara esa fila creada
df

      animal edad visitas prioridad
a       gato  2.5       1        si
b       gato    3       3        si
c  serpiente  0.5       2        no
d      perro  NaN       3        si
e      perro    5       2        no
f       gato  1.5       3        no
g  serpiente  4.5       1        no
h       gato  NaN       1        si
i      perro    7       2        no
j      perro    3       1        no
k

      animal edad visitas prioridad
a       gato  2.5       1        si
b       gato    3       3        si
c  serpiente  0.5       2        no
d      perro  NaN       3        si
e      perro    5       2        no
f       gato  1.5       3        no
g  serpiente  4.5       1        no
h       gato  NaN       1        si
i      perro    7       2        no
j      perro    3       1        no

**17.** Cuente el número de cada tipo de animal en `df`.

In [16]:
df['animal'].value_counts() #Devuelve un objeto que contiene recuentos de valores únicos

perro        4
gato         4
serpiente    2
Name: animal, dtype: int64

**18.** Ordene `df` primero por los valores en la 'edad' en orden descendente, luego por el valor en la columna 'visitas' en orden ascendente (por lo que la fila `i` debe ser la primera y la fila `d` debe ser la última).

In [17]:
des_edad=df.sort_values(by=['edad'],ascending=False ,inplace=False)
print('En orden descendente de la edad:\n',des_edad)
asc_vis=df.sort_values(by=['visitas'],ascending=True ,inplace=False)
print('\nEn orden ascendente de la visitas:\n',asc_vis)

En orden descendente de la edad:
       animal edad visitas prioridad
i      perro    7       2        no
e      perro    5       2        no
g  serpiente  4.5       1        no
b       gato    3       3        si
j      perro    3       1        no
a       gato  2.5       1        si
f       gato  1.5       3        no
c  serpiente  0.5       2        no
d      perro  NaN       3        si
h       gato  NaN       1        si

En orden ascendente de la visitas:
       animal edad visitas prioridad
a       gato  2.5       1        si
g  serpiente  4.5       1        no
h       gato  NaN       1        si
j      perro    3       1        no
c  serpiente  0.5       2        no
e      perro    5       2        no
i      perro    7       2        no
b       gato    3       3        si
d      perro  NaN       3        si
f       gato  1.5       3        no

**19.** La columna 'prioridad' contiene los valores 'sí' y 'no'. Reemplace esta columna con una columna de valores booleanos: 'sí' debe ser `True` y 'no' debe ser `False`.

In [18]:
pri_bool= df.replace({'prioridad': {'si': 'True', 'no': 'False'}})
pri_bool

      animal edad visitas prioridad
a       gato  2.5       1      True
b       gato    3       3      True
c  serpiente  0.5       2     False
d      perro  NaN       3      True
e      perro    5       2     False
f       gato  1.5       3     False
g  serpiente  4.5       1     False
h       gato  NaN       1      True
i      perro    7       2     False
j      perro    3       1     False

**20.** En la columna 'animal', cambie las entradas de 'serpiente' a 'python'..

In [19]:
ser_py = df.replace({'animal': {'serpiente': 'python'}})
ser_py

   animal edad visitas prioridad
a    gato  2.5       1        si
b    gato    3       3        si
c  python  0.5       2        no
d   perro  NaN       3        si
e   perro    5       2        no
f    gato  1.5       3        no
g  python  4.5       1        no
h    gato  NaN       1        si
i   perro    7       2        no
j   perro    3       1        no

**21.** Para cada tipo de animal y cada número de visitas, encuentre la edad media. En otras palabras, cada fila es un animal, cada columna es un número de visitas y los valores son las edades medias.

In [22]:
#Nota: hay que volver ha ejecutar el punto 4 luego este para que se ejecute correctamente 
table=pd.pivot_table(df,values='edad',index='animal',columns='visitas',aggfunc=np.mean)
table

visitas      1    2    3
animal
gato       2.5  NaN  2.5
perro      3.0  6.0  NaN
serpiente  4.5  0.5  NaN

###  es posible que deba combinar dos o más métodos para obtener la respuesta correcta

A continuación se muestran algunas formas en las que podría necesitar filtrar los datos, pero para las cuales no existe un método único "listo para usar".

**22.** Se tiene un DataFrame `df` con una columna 'A' de enteros.  
```python
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

¿Cómo se filtran las filas que contienen el mismo número entero que la fila inmediatamente superior?

Debería quedarse con una columna que contiene los siguientes valores:

```python
1, 2, 3, 4, 5, 6, 7
```

In [23]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
filtro = df.drop_duplicates(subset='A') #Devuelve DataFrame con filas duplicadas eliminadas
print('las filas que contienen el mismo número entero:\n',filtro)

las filas que contienen el mismo número entero:
    A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

**23.** Dado un DataFrame de valores numéricos:
```python
df = pd.DataFrame(np.random.random(size=(5, 3))) # tabla de valores reales de 5x3  
```

¿Cómo se resta la media de la fila de cada elemento de la fila?

In [119]:
df = pd.DataFrame(np.random.random(size=(5, 3))) # tabla de valores reales de 5x3
print(df)
resta = df.sub(df.mean(axis=1), axis=0) #Obtenga la resta de dataframe y otros elementos por elemento (operador binario sub )
print('\nResta la media de la fila de cada elemento de la fila:\n',resta)

          0         1         2
0  0.280535  0.582848  0.545825
1  0.669213  0.491155  0.150029
2  0.986795  0.043807  0.151124
3  0.536987  0.473204  0.537081
4  0.520282  0.310168  0.459134

Resta la media de la fila de cada elemento de la fila:
           0         1         2
0 -0.189201  0.113112  0.076089
1  0.232414  0.054356 -0.286770
2  0.592886 -0.350102 -0.242785
3  0.021230 -0.042553  0.021324
4  0.090421 -0.119693  0.029272

**24.** Suponga que tiene DataFrame con 10 columnas de números reales, por ejemplo:

```python
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```

¿Qué columna de números tiene la suma más pequeña? Devuelva la etiqueta de esa columna.

In [49]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
print(df)

#Vamos agregar otra fila con la sumatoria de cada columna
df.loc[5] =[df['a'].sum(),df['b'].sum(),df['c'].sum(),df['d'].sum(),df['e'].sum(),df['f'].sum(),df['g'].sum(),df['h'].sum(),df['i'].sum(),df['j'].sum()]
print('\nNuevo dataframe:\n',df)
mindf = df.iloc[5,:].min() #Buscamaos el valor minimo de esa fila que es la suma 
df[:][df == mindf]

          a         b         c         d         e         f         g  \
0  0.403516  0.624344  0.286147  0.156249  0.633657  0.701758  0.504949
1  0.027447  0.137463  0.313384  0.715810  0.529746  0.192597  0.320083
2  0.592970  0.483687  0.427335  0.997495  0.125796  0.564519  0.671769
3  0.874625  0.821066  0.008089  0.692268  0.124525  0.863164  0.311327
4  0.993125  0.856141  0.316556  0.490575  0.367677  0.033681  0.938292

          h         i         j
0  0.094648  0.311737  0.126238
1  0.059685  0.967179  0.564433
2  0.060955  0.049297  0.196331
3  0.404505  0.472920  0.899561
4  0.850611  0.683914  0.509319

Nuevo dataframe:
           a         b         c         d         e         f         g  \
0  0.403516  0.624344  0.286147  0.156249  0.633657  0.701758  0.504949
1  0.027447  0.137463  0.313384  0.715810  0.529746  0.192597  0.320083
2  0.592970  0.483687  0.427335  0.997495  0.125796  0.564519  0.671769
3  0.874625  0.821066  0.008089  0.692268  0.124525  0.863164  0.311327
4  0.993125  0.856141  0.316556  0.490575  0.367677  0.033681  0.938292
5  2.891683  2.922700  1.351512  3.052396  1.781403  2.355718  2.746419

          h         i         j
0  0.094648  0.311737  0.126238
1  0.059685  0.967179  0.564433
2  0.060955  0.049297  0.196331
3  0.404505  0.472920  0.899561
4  0.850611  0.683914  0.509319
5  1.470403  2.485047  2.295880

    a   b         c   d   e   f   g   h   i   j
0 NaN NaN       NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN       NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN       NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN       NaN NaN NaN NaN NaN NaN NaN NaN
4 NaN NaN       NaN NaN NaN NaN NaN NaN NaN NaN
5 NaN NaN  1.351512 NaN NaN NaN NaN NaN NaN NaN

**25.** ¿Cómo se cuenta cuántas filas únicas tiene un DataFrame (es decir, ignora todas las filas que están duplicadas)? Como entrada, use un DataFrame de ceros y unos con 10 filas y 3 columnas.

```python
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
```

In [50]:
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
print(df)
df.iloc[[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]].drop_duplicates()

   0  1  2
0  0  0  1
1  1  1  0
2  0  1  0
3  1  1  1
4  0  0  1
5  0  0  0
6  0  1  1
7  0  0  0
8  0  0  0
9  1  0  0

   0  1  2
0  0  0  1
1  1  1  0
2  0  1  0
3  1  1  1
5  0  0  0
6  0  1  1
9  1  0  0

**26.** En la celda a continuación, se tiene un DataFrame `df` que consta de 10 columnas de números reales. De esos exactamente   5 entradas en cada fila son valores de NaN. 

Para cada fila del DataFrame, busque la columna que contiene el tercer valor de NaN.

Debe devolver una columna de etiquetas de la forma: `e, c, d, h, d`

In [51]:
nan = np.nan

data = [[0.04,  nan,  nan, 0.25,  nan, 0.43, 0.71, 0.51,  nan,  nan],
        [ nan,  nan,  nan, 0.04, 0.76,  nan,  nan, 0.67, 0.76, 0.16],
        [ nan,  nan, 0.5 ,  nan, 0.31, 0.4 ,  nan,  nan, 0.24, 0.01],
        [0.49,  nan,  nan, 0.62, 0.73, 0.26, 0.85,  nan,  nan,  nan],
        [ nan,  nan, 0.41,  nan, 0.05,  nan, 0.61,  nan, 0.48, 0.68]]

columnas = list('abcdefghij')

df = pd.DataFrame(data, columns=columnas)
print(df)

# e c d h d
(df.isnull().cumsum(axis=1)==3).idxmax(axis=1)

      a   b     c     d     e     f     g     h     i     j
0  0.04 NaN   NaN  0.25   NaN  0.43  0.71  0.51   NaN   NaN
1   NaN NaN   NaN  0.04  0.76   NaN   NaN  0.67  0.76  0.16
2   NaN NaN  0.50   NaN  0.31  0.40   NaN   NaN  0.24  0.01
3  0.49 NaN   NaN  0.62  0.73  0.26  0.85   NaN   NaN   NaN
4   NaN NaN  0.41   NaN  0.05   NaN  0.61   NaN  0.48  0.68

0    e
1    c
2    d
3    h
4    d
dtype: object

**27.** Implemente una media móvil el grupos con tamaño de ventana 3, que ignora el valor de NaN. Por ejemplo, considere el siguiente DataFrame::

```python
>>> df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})
>>> df
   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0
```
se debe calcular el filtro y obtener estos valores

```
0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
```
P.ej. la primera ventana de tamaño tres para el grupo 'b' tiene valores 3.0, NaN y 3.0 y ocurre en el índice de fila 5. En lugar de ser NaN, el valor en la nueva columna en este índice de fila debe ser 3.0 (solo los dos valores que no son NaN se utilizan para calcular la media (3 + 3) / 2)

In [53]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})
df1=df.groupby(['group'])['value']
valc=df.fillna(0).groupby(['group'])['value']
vent=valc.rolling(3,min_periods=1).sum()/df1.rolling(3,min_periods=1).count()
vent
vent.reset_index(level=0,drop=True).sort_index()

0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
Name: value, dtype: float64